let staffDatas = {
    '謝政廷':{
        'name':'謝政廷',
        'career':'心健中心執行長 / 芳蘭心理諮商所所長',        //請輸入個人職稱，不可斷行
        'quote':`空白測試`,         //放個人語錄，可斷行
			'major':['兒童心理諮商','兒童心理諮商','沙盤治療','親師諮詢','表達性藝術治療'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':''       //放個人網站,不需包含網域 https://www.psychntue.com
    }
    '吳毓瑩':{
        'name':'吳毓瑩',
        'career':'心健中心主任 / 芳蘭心理諮商所營運顧問',        //請輸入個人職稱，不可斷行
        'quote':`生命無常，人生好難。每個關卡，疼惜自己走過。`,         //放個人語錄，可斷行
        'major':['阿德勒取向','生師諮詢','親子諮詢','生涯建構諮商'],         //放個人專長，專長之間請用逗點分開,
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'許鈞翔':{
        'name':'許鈞翔',
        'career':'芳蘭心理諮商所專任心理師 / 諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`空白`,         //放個人語錄，可斷行
        'major':['情感與親密關係','職場壓力與職場關係','人際與原生家庭議題','憂慮與焦慮情緒困擾','成人自我探索與成長'],//放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'劉士煜':{
        'name':'劉士煜',
        'career':'芳蘭心理諮商所專任心理師 / 諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`我們期待理解，但我們不能期待烏托邦會自己形成`,         //放個人語錄，可斷行
        'major':['多元性別','生涯議題','人際議題','情緒探索'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'林俊翰':{
        'name':'林俊翰',
        'career':'芳蘭心理諮商所專任心理師 / 諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`空白測試`,         //放個人語錄，可斷行
        'major':['後現代取向','青少年諮商','表達性藝術治療','情緒與壓力調適'],//放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'陳怡婷':{
        'name':'陳怡婷',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`開拓視野，突破萬難，看見世界，貼近彼此，感受生活，這就是生活的目的。（白日夢冒險王）`,         //放個人語錄，可斷行
        'major':['日語諮商','職場心理健康','藝術治療','正念舒壓','親子關係','森林療癒'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'邱佳怡':{
        'name':'邱佳怡',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`你不需要很厲害才開始，你需要開始才能很厲害。`,         //放個人語錄，可斷行
        'major':['身心發展','生活適應','家庭關係','人際關係','職涯發展','焦慮','睡眠障礙','壓力調適','飲食與情緒'], //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'吳欣儒':{
        'name':'吳欣儒',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`充滿迷霧的道路上，我們交會相伴，拾起勇氣同行，時而沈澱歇息，只要走得夠遠，一定能到達某個屬於自己的地方。`,         //放個人語錄，可斷行
        'major':['原生家庭','親子關係','母女議題','親密關係','伴侶會談','沙遊治療','人我界線','身心困擾','成癮行為諮商'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'吳孔琪':{
        'name':'吳孔琪',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`如果生命中有段旅程，需要一起聽、一起說、一起想、一起感受，我，願與你同行，相信，那是一次次心的交會。`,         //放個人語錄，可斷行
        'major':['親密關係','婚前預備','伴侶諮商','婚姻文化調適','親職教養','親子溝通','家族治療','生涯探索','新創團隊凝聚','企業諮商','二代接班協商','自我成長整合','情緒壓力調適','原生家庭探索'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'徐藝溶':{
        'name':'徐藝溶',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`我們無法阻止過去的逆境發生，但可以給現在的自己一個機會，從傷痛中找回力量，活出更自在的未來。`,         //放個人語錄，可斷行
        'major':['後現代取向','情感議題','家庭議題','創傷議題'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'廖俞榕':{
        'name':'廖俞榕',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`我們的內在像一個大家庭，喜悅與痛苦同時存在。邀請你，走進內在世界，允許各種感受的存在，真心理解並展開對話。`,         //放個人語錄，可斷行
        'major':['創傷議題','悲傷失落','關係與情感議題','原生家庭探索','人際歷程取向','內在家庭系統治療','身體感官經驗介入','關係取向遊戲治療','沙盤治療'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'陳怡真':{
        'name':'陳怡真',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`願你像流動的空氣一般深沉的平安；
願你像寧靜的大地一般深沉的平安；
願你像閃耀的星光一般深沉的平安；
願你像溫柔的月亮一般深沉的平安。`,         //放個人語錄，可斷行
        'major':['自我探索','自我肯定','壓力因應與管理','情緒調適','睡眠障礙','人際困擾','原生家庭議題','個人成長教練','學業輔道及學習目標達成','企業經營管理'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'張雅舒':{
        'name':'張雅舒',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`相信在關係中能夠感動，並將心中的感動漫延的孩子，會長成可愛一點的大人。而每一個大人，心中都有一個孩子，需要被懂得陪伴、同行一段。`,         //放個人語錄，可斷行
        'major':['心理動力取向心理治療','表達性藝術治療','兒童遊戲治療','家長親職諮詢','情緒與壓力調適','失落與創傷議題','自我探索與整合'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'賴敬云':{
        'name':'賴敬云',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`空白。`,         //放個人語錄，可斷行
        'major':['空白','空白'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'郭欣柔':{
        'name':'郭欣柔',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`空白。`,         //放個人語錄，可斷行
        'major':['空白','空白'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
    }
	'蔡秉儒':{
        'name':'蔡秉儒',
        'career':'諮商心理師',        //請輸入個人職稱，不可斷行
        'quote':`空白。`,         //放個人語錄，可斷行
        'major':['空白','空白'],         //放個人專長，專長之間請用逗點分開
        'pageUrl':'空白測試'       //放個人網站,不需包含網域 https://www.psychntue.com
	}.


}

if(document.querySelector('.staffs')) importStaffData()

function importStaffData(){
    var staff = document.querySelectorAll('.staffs');
    for(var i=0; i<staff.length; i++){
        var staffName = staff[i].getAttribute('name');
        if(staffDatas[staffName]){
            var staffData = staffDatas[staffName];
            var skills = staffData.major.split(',').filter(x => x != '').map(x => `<h4 class="skills">${x}</h4>`).join('')
            var htmlName = `<h3>${staffData.name}</h3>`;
            var htmlCareer = `<p>${staffData.career}</p>`;
            var htmlQuote = `<blockquote class="cus-quote">${staffData.quote}</blockquote>`;
            var htmlSkills = `<div class="skills-box">${skills}</div>`
            staff[i].innerHTML = htmlName + htmlCareer + htmlQuote + htmlSkills;
            console.log(`${staffName}資訊輸入完成`)
        }
        else{
            console.log(`無人員${staffName}的資訊`)
            continue;
        }
    }
}
